InformationRegisters/НастройкиСинхронизацииGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСинхронизацииGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТокенаДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияКалендарей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаписиСинхронизацииКалендарей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗаписиСинхронизацииКалендарей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокОбъекта</Name>
					<Comment>Etag</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаписьРабочегоКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияКалендарей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЗаписиРабочегоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЗаписиРабочегоКалендаря</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПовторения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПовторения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовторения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторениеПоДнямМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторениеПоМесяцам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОкончанияПовторения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаОкончанияПовторения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаписейРабочегоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписиКалендаря</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗаписиКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаПовторения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЧастотаПовторения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Связанная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйПредмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключенияПовторения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИсключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьИсключения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПовторениеПоДням</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СинхронизацияGoogle/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//	Общие серверные процедуры для синхронизации с Google API
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	НовыеРазрешения = Новый Массив;
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"googleapis.com",
		443,
		НСтр("ru = 'Google API (https://www.googleapis.com/)'"));
	НовыеРазрешения.Добавить(Разрешение);
	ЗапросыРазрешений.Добавить(РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	
КонецПроцедуры

Функция ИдентификаторПриложения() Экспорт

	Возврат ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляGoogle();

КонецФункции

Функция АдресЗапросаНаПодтверждениеДоступа() Экспорт

	ИдентификаторПриложения = ИдентификаторПриложения();
	Если Не ЗначениеЗаполнено(ИдентификаторПриложения.client_id) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для конфигурации %1 не определены учетные данные Google'"), Метаданные.Имя);
		ЗарегистрироватьОшибку(ТекстОшибки, ТекстОшибки);
		ВызватьИсключение НСтр("ru = 'При подключении возникла ошибка. Обратитесь к администратору.'");
	КонецЕсли;	
	АдресЗапросаНаПодтверждениеДоступа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1?scope=%2&redirect_uri=%3&response_type=code&client_id=%4&approval_prompt=force",
		ИдентификаторПриложения.auth_uri,		// 1
		АдресGoogleAPI() + "/auth/calendar",	// 2
		ИдентификаторПриложения.redirect_uri,	// 3
		ИдентификаторПриложения.client_id);		// 4
	Возврат АдресЗапросаНаПодтверждениеДоступа;

КонецФункции

Процедура ПолучитьСписокКалендарейВФоне(ПараметрыПроцедуры, АдресХранилища) Экспорт

	Результат = Новый Структура;
	Если ПараметрыПроцедуры.Свойство("КодРазрешения") Тогда
		ДанныеАвторизации = ДанныеАвторизацииПоКодуРазрешения(ПараметрыПроцедуры.КодРазрешения);
	Иначе
		ДанныеАвторизации = РегистрыСведений.НастройкиСинхронизацииGoogle.ДействительныеДанныеАвторизации(ПараметрыПроцедуры.Узел);
	КонецЕсли;
	Результат.Вставить("ДанныеАвторизации", ДанныеАвторизации);
	СписокКалендарей = СписокКалендарейПользователя(ДанныеАвторизации);
	Результат.Вставить("СписокКалендарей", СписокКалендарей);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

Процедура ВыгрузитьДанныеКалендаря(ОписаниеКалендаря) Экспорт

	ДанныеАвторизации = РегистрыСведений.НастройкиСинхронизацииGoogle.ДействительныеДанныеАвторизации(ОписаниеКалендаря.Узел);
	Если Не ЗначениеЗаполнено(ДанныеАвторизации.ТокенДоступа) Тогда
		КраткийТекстОшибки =
			НСтр("ru = 'При подключении к календарю возникла ошибка доступа, проверьте настройки подключения.'");
		ПодробныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить данные авторизации для узла %1.'"), ОписаниеКалендаря.Узел);
		ЗарегистрироватьОшибку(КраткийТекстОшибки, ПодробныйТекстОшибки);
		ВызватьИсключение КраткийТекстОшибки;
	КонецЕсли;
	ДанныеДляВыгрузки = ОписаниеКалендаря.События.СкопироватьКолонки();
	Для Каждого Событие Из ОписаниеКалендаря.События Цикл
		НоваяСтрока = ДанныеДляВыгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Событие);
		Если ДанныеДляВыгрузки.Количество() < 50 Тогда
			Продолжить;
		КонецЕсли;
		ВыгрузитьДанныеВУзел(ОписаниеКалендаря.Узел, ОписаниеКалендаря.Идентификатор, ДанныеДляВыгрузки,
			ДанныеАвторизации, ОписаниеКалендаря.ВремяУведомленийЭкспорт);
		ДанныеДляВыгрузки.Очистить();
	КонецЦикла;
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки) Тогда
		ВыгрузитьДанныеВУзел(ОписаниеКалендаря.Узел, ОписаниеКалендаря.Идентификатор, ДанныеДляВыгрузки,
			ДанныеАвторизации, ОписаниеКалендаря.ВремяУведомленийЭкспорт);
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьДанныеКалендаря(ОписаниеКалендаря, ДатаНачала, ДатаОкончания) Экспорт

	ДанныеАвторизации = РегистрыСведений.НастройкиСинхронизацииGoogle.ДействительныеДанныеАвторизации(ОписаниеКалендаря.Узел);
	Если Не ЗначениеЗаполнено(ДанныеАвторизации.ТокенДоступа) Тогда
		КраткийТекстОшибки =
			НСтр("ru = 'При подключении к календарю возникла ошибка доступа, проверьте настройки подключения.'");
		ПодробныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить данные авторизации для узла %1.'"), ОписаниеКалендаря.Узел);
		ЗарегистрироватьОшибку(КраткийТекстОшибки, ПодробныйТекстОшибки);
		ВызватьИсключение КраткийТекстОшибки;
	КонецЕсли;
	ЗаполнитьСобытияКалендаря(ДанныеАвторизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяГраницаСекций()

	Возврат СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");

КонецФункции

Функция АдресGoogleAPI()

	Возврат "https://www.googleapis.com";

КонецФункции

Функция HTTPСоединениеGoogle(СтруктураURI)

	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
	КонецЕсли;
	Таймаут = 20;
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	Возврат Новый HTTPСоединение(
		СтруктураURI.Хост,
		СтруктураURI.Порт,,,
		ИнтернетПрокси, Таймаут,
		ЗащищенноеСоединение);

КонецФункции

Функция ТелоПакетногоЗапросаИзменениеДанныхКалендаря(Узел, ИдентификаторКалендаря, ДанныеДляВыгрузки, ГраницаСекций, ВремяУведомлений)

	Результат = "";
	Для Каждого Событие Из ДанныеДляВыгрузки Цикл
		ДанныеДляИзменения = Новый Соответствие;
		Если Не ЗначениеЗаполнено(Событие.Идентификатор) Тогда
			ИдентификаторНовогоСобытия = СтрЗаменить(Новый УникальныйИдентификатор, "-", ""); // Google не принимает идентификаторы с тире
			ДанныеДляИзменения["id"] = ИдентификаторНовогоСобытия;
			ДанныеДляИзменения["reminders"] = ОписаниеНапоминания(ВремяУведомлений);
			МенеджерЗаписи = РегистрыСведений.ЗаписиСинхронизацииКалендарей.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЗаписьРабочегоКалендаря 	= Событие.Ссылка;
			МенеджерЗаписи.Узел 					= Узел;
			МенеджерЗаписи.ИдентификаторКалендаря	= ИдентификаторКалендаря;
			МенеджерЗаписи.Идентификатор 			= ИдентификаторНовогоСобытия;
			МенеджерЗаписи.ОтпечатокОбъекта 		= "";
			МенеджерЗаписи.Записать();
		КонецЕсли;
		Если Событие.ПометкаУдаления Тогда
			ДанныеДляИзменения["status"] = "cancelled"
		Иначе
			ДанныеДляИзменения["status"] = "tentative";
		КонецЕсли;
		ДанныеДляИзменения["description"] = ОписаниеЗаписиКалендаряGoogle(Событие.Описание);
		ДанныеДляИзменения["summary"] = НазваниеЗаписиКалендаряGoogle(Событие.Описание);
		
		ВесьДень = Событие.ДатаНачала = НачалоДня(Событие.ДатаНачала)
			И Событие.ДатаОкончания = КонецДня(Событие.ДатаОкончания);
		ДанныеДляИзменения["start"] = ОписаниеДатыСобытия(Событие.ДатаНачала, ВесьДень, "ДатаНачала");
		ДанныеДляИзменения["end"] = ОписаниеДатыСобытия(Событие.ДатаОкончания, ВесьДень, "ДатаОкончания");
		
		Если Событие.ПометкаУдаления Тогда
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1--%2
				|Content-Type: application/http
				|Content-ID: %3
				|
				|%4 /calendar/v3/calendars/%5/events/%6",
				ОтступДляСекции(Результат),					// 1
				ГраницаСекций,								// 2
				Событие.Ссылка.УникальныйИдентификатор(),	// 3
				ИмяМетодаHTTP(Событие),						// 4
				ИдентификаторКалендаря,						// 5
				Событие.Идентификатор);						// 6
		Иначе
			ИмяМетода = ИмяМетодаHTTP(Событие);
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			НастройкиСериализации = Новый НастройкиСериализацииJSON;
			НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
			ЗаписатьJSON(ЗаписьJSON, ДанныеДляИзменения, НастройкиСериализации);
			СтрокаJSON = СтрЗаменить(ЗаписьJSON.Закрыть(), """%null%""", "null"); // Удаление полей
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1--%2
				|Content-Type: application/http
				|Content-ID: %3
				|
				|%4 /calendar/v3/calendars/%5/events/%6%7
				|Content-Type: application/json
				|%8
				|%9",
				ОтступДляСекции(Результат),					// 1
				ГраницаСекций,								// 2
				Событие.Ссылка.УникальныйИдентификатор(),	// 3
				ИмяМетода,									// 4
				ИдентификаторКалендаря,						// 5
				Событие.Идентификатор,						// 6
				ПередаваемыеПоля(Событие.Идентификатор),	// 7
				ЗаголовокETag(Событие.ОтпечатокОбъекта),	// 8
				СтрокаJSON);								// 9
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Результат) Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1
		|
		|--%2--",
		Результат,
		ГраницаСекций);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ОписаниеНапоминания(Секунд)

	Результат = Новый Соответствие;
	Если Секунд > 0 Тогда
		Минут = Цел(Секунд/60);
		Результат["useDefault"] = "false";
		ОписаниеНапоминаний = Новый Массив;
		ОписаниеНапоминания = Новый Соответствие();
		ОписаниеНапоминания.Вставить("method",  "popup");
		ОписаниеНапоминания.Вставить("minutes", Минут);
		ОписаниеНапоминаний.Добавить(ОписаниеНапоминания);
		Результат["overrides"] = ОписаниеНапоминаний;
	Иначе
		Результат["useDefault"] = "true";
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ОписаниеДатыСобытия(Знач ДатаВремя, ВесьДень, ТипДаты)

	Результат = Новый Соответствие;
	ДатаВремяПриведенноеКСерверу = МестноеВремя(УниверсальноеВремя(ДатаВремя, ПолучитьЧасовойПоясИнформационнойБазы()));
	Если ВесьДень И ТипДаты = "ДатаНачала" Тогда
		Результат["date"] = Формат(ДатаВремяПриведенноеКСерверу, "ДФ=yyyy-MM-dd");
		Результат["dateTime"] = "%null%";
	ИначеЕсли ВесьДень И ТипДаты = "ДатаОкончания" Тогда
		Результат["date"] = Формат(ДатаВремяПриведенноеКСерверу + 86400, "ДФ=yyyy-MM-dd");
		Результат["dateTime"] = "%null%";
	Иначе
		Результат["date"] = "%null%";
		Результат["dateTime"] = ДатаВремяПриведенноеКСерверу;
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ЗаголовокETag(ETag)

	Если ЗначениеЗаполнено(ETag) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"If-Match: %1%2",
		ETag,
		Символы.ПС);
	КонецЕсли;
	Возврат "";

КонецФункции

Функция ПередаваемыеПоля(Идентификатор)

	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат "?fields=etag,start,end,status,summary,description,attendees";
	КонецЕсли;
	Возврат "";

КонецФункции

Функция ОтступДляСекции(ТелоСообщения)

	Если ЗначениеЗаполнено(ТелоСообщения) Тогда
		Возврат ТелоСообщения + Символы.ПС + Символы.ПС;
	КонецЕсли;
	Возврат "";

КонецФункции

Функция ИмяМетодаHTTP(Событие)

	Если Событие.ПометкаУдаления Тогда
		Возврат "DELETE";
	КонецЕсли;
	Если ЗначениеЗаполнено(Событие.Идентификатор) Тогда
		Возврат "PATCH";
	КонецЕсли;
	Возврат "POST";

КонецФункции

Функция ВосстановитьДатуJSON(Свойство, Значение, Параметры) Экспорт

	Попытка
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Синхронизация календарей'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось прочитать дату JSON для свойства ""%1"": ""%2"".'"),
			Свойство,
			Значение));
	КонецПопытки;
	Возврат '0001-01-01';

КонецФункции

Функция ПараметрПериод(ТокенСинхронизации, ДатаНачала, ДатаОкончания)

	Если ЗначениеЗаполнено(ТокенСинхронизации) Тогда
		Возврат "";
	КонецЕсли;
	Начало = ЗаписатьДатуJSON(
	ДатаНачала,
	ФорматДатыJSON.ISO,
	ВариантЗаписиДатыJSON.УниверсальнаяДата);
	Окончание = ЗаписатьДатуJSON(
	ДатаОкончания,
	ФорматДатыJSON.ISO,
	ВариантЗаписиДатыJSON.УниверсальнаяДата);
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&timeMin=%1&timeMax=%2", Начало, Окончание);

КонецФункции

Функция ПараметрТокенСинхронизации(ТокенСинхронизации)

	Если ЗначениеЗаполнено(ТокенСинхронизации) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&syncToken=%1", ТокенСинхронизации);
	КонецЕсли;
	Возврат "";

КонецФункции

Функция ПараметрСтраничныйТокен(СтраничныйТокен)

	Если ЗначениеЗаполнено(СтраничныйТокен) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&pageToken=%1", СтраничныйТокен);
	КонецЕсли;
	Возврат "";

КонецФункции

Процедура ЗаполнитьПолеДатаВремя(Приемник, ИмяПоляПриемник, Источник, ИмяПоляИсточник)

	Если Не ЗначениеЗаполнено(Источник[ИмяПоляИсточник]) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Источник[ИмяПоляИсточник]["dateTime"]) Тогда
		ЗначениеПоляДатаВремя = Источник[ИмяПоляИсточник]["dateTime"];
	Иначе
		ЗначениеПоляДатаВремя = Источник[ИмяПоляИсточник]["date"];
	КонецЕсли;
	ЗначениеПриведенноеКЧасовомуПоясуИБ = МестноеВремя(УниверсальноеВремя(ЗначениеПоляДатаВремя), ПолучитьЧасовойПоясИнформационнойБазы());
	Приемник[ИмяПоляПриемник] = ЗначениеПриведенноеКЧасовомуПоясуИБ;

КонецПроцедуры

Процедура ВыгрузитьДанныеВУзел(Узел, ИдентификаторКалендаря, ДанныеДляВыгрузки, ДанныеАвторизации, ВремяУведомлений)
	
	// ЗаписьСообщения используется только для управления нумерацией сообщений и блокировки узла.
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Узел);
	
	ГраницаСекций = НоваяГраницаСекций();
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресGoogleAPI() + "/batch/calendar/v3");
	Соединение = HTTPСоединениеGoogle(СтруктураURI);
	ТелоКакСтрока = ТелоПакетногоЗапросаИзменениеДанныхКалендаря(
		Узел, ИдентификаторКалендаря, ДанныеДляВыгрузки, ГраницаСекций, ВремяУведомлений);
	Если Не ЗначениеЗаполнено(ТелоКакСтрока) Тогда
		Возврат;
	КонецЕсли;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 %2", ДанныеАвторизации["ТипТокенаДоступа"], ДанныеАвторизации["ТокенДоступа"]));
	Заголовки.Вставить("Content-Type", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"multipart/mixed; boundary=%1", ГраницаСекций));
	Запрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоКакСтрока,, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Если Не Ответ.КодСостояния = 200 Тогда
		Возврат;
	КонецЕсли;
	
	// Установим новые отпечатки объектов, полученные с сервера.
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если СтрНачинаетсяС(ТелоОтвета, "--") Тогда
		
		// Ответ приходит в виде пакета - каждую секцию пакета анализируем отдельно.
		ЭтоКонецСекции = Ложь;
		ГраницаСекцийОтвета = СтрПолучитьСтроку(ТелоОтвета, 1);
		МеткаИдентификатораСекцииОтвета = "content-id: response-";
		СмещениеИдентификатораСекцииОтвета = СтрДлина(МеткаИдентификатораСекцииОтвета) + 1;
		МеткаОтпечаткаОбъекта = "etag:";
		СмещениеОтпечаткаОбъекта = СтрДлина(МеткаОтпечаткаОбъекта) + 1;
		
		// В секции ответа нужно найти идентификатор секции (это идентификатор записи календаря) и отпечаток объекта.
		ИдентификаторСекцииОтвета = "";
		ОтпечатокОбъектаСекции = "";
		Для Каждого СтрокаОтвета Из СтрРазделить(ТелоОтвета, Символы.ПС) Цикл
			
			Если СтрНачинаетсяС(СтрокаОтвета, ГраницаСекцийОтвета) Тогда
				
				// Для обновления в секции необходимо найти отпечаток и идентификатор нужного формата.
				Если ЗначениеЗаполнено(ИдентификаторСекцииОтвета)
					И ЗначениеЗаполнено(ОтпечатокОбъектаСекции)
					И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторСекцииОтвета) Тогда
					
					ЗаписьКалендаряСекции = Справочники.ЗаписиРабочегоКалендаря.ПолучитьСсылку(
						Новый УникальныйИдентификатор(ИдентификаторСекцииОтвета));
					
					МенеджерЗаписи = РегистрыСведений.ЗаписиСинхронизацииКалендарей.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ЗаписьРабочегоКалендаря = ЗаписьКалендаряСекции;
					МенеджерЗаписи.Узел = Узел;
					МенеджерЗаписи.Прочитать();
					
					// Отпечаток объекта обновляем, только если уже есть данные, и отпечаток изменился.
					Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ОтпечатокОбъекта <> ОтпечатокОбъектаСекции Тогда
						МенеджерЗаписи.ОтпечатокОбъекта = ОтпечатокОбъектаСекции;
						МенеджерЗаписи.Записать();
					КонецЕсли;
					
				КонецЕсли;
				
				// Начинается новая секция.
				ИдентификаторСекцииОтвета = "";
				ОтпечатокОбъектаСекции = "";
				
				Продолжить;
				
			КонецЕсли;
			
			НРегСтрокаОтвета = НРег(СтрокаОтвета);
			Если СтрНачинаетсяС(НРегСтрокаОтвета, МеткаИдентификатораСекцииОтвета) Тогда
				ИдентификаторСекцииОтвета = СокрЛП(Сред(СтрокаОтвета, СмещениеИдентификатораСекцииОтвета));
			ИначеЕсли СтрНачинаетсяС(НРегСтрокаОтвета, "etag:") Тогда
				ОтпечатокОбъектаСекции = СокрЛП(Сред(СтрокаОтвета, СмещениеОтпечаткаОбъекта));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения, ДанныеДляВыгрузки.ВыгрузитьКолонку("Ссылка"));
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);

КонецПроцедуры

Процедура ЗаполнитьСобытияКалендаря(ДанныеАвторизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания, СтраничныйТокен = Неопределено)

	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 12);
	КонецЕсли;
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			АдресGoogleAPI() + "/calendar/v3/calendars/%1/events?singleEvents=True&maxResults=256&timeZone=%2%3%4%5",
			ОписаниеКалендаря.Идентификатор, // 1
			ЧасовойПояс(), // 2
			ПараметрПериод(ОписаниеКалендаря.ТокенСинхронизации, ДатаНачала, ДатаОкончания), // 3
			ПараметрТокенСинхронизации(ОписаниеКалендаря.ТокенСинхронизации), // 4
			ПараметрСтраничныйТокен(СтраничныйТокен))); // 5
	СтрокаJSON = ВызватьGET(СтруктураURI, ДанныеАвторизации);
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON,
		Истина,,,
		"ВосстановитьДатуJSON",
		СинхронизацияGoogle,,
		СтрРазделить("created,date,dateTime,updated", ","));
	Если Не РезультатЧтенияJSON["error"] = Неопределено
		И РезультатЧтенияJSON["error"]["code"] = 410 Тогда
		// Выполняется полная синхронизация, без указания токена синхронизации
		ОписаниеКалендаря.ТокенСинхронизации = "";
		ЗаполнитьСобытияКалендаря(ДанныеАвторизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания, СтраничныйТокен);
		Возврат;
	КонецЕсли;
	Если РезультатЧтенияJSON["error"] <> Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Произошла ошибка синхронизации с Google Calendar: %1'"),
		РезультатЧтенияJSON["error"]["message"]);
	КонецЕсли;
	Для Каждого ТекОписаниеСобытия Из РезультатЧтенияJSON["items"] Цикл
		НоваяСтрока = ОписаниеКалендаря.События.Добавить();
		НоваяСтрока.Наименование		= ТекОписаниеСобытия["summary"];
		НоваяСтрока.Описание			= ОписаниеЗаписиКалендаря(ТекОписаниеСобытия["summary"], ТекОписаниеСобытия["description"]);
		НоваяСтрока.Идентификатор		= ТекОписаниеСобытия["id"];
		НоваяСтрока.ОтпечатокОбъекта	= ТекОписаниеСобытия["etag"];
		НоваяСтрока.ПометкаУдаления		= (ТекОписаниеСобытия["status"] = "cancelled");
		ЗаполнитьПолеДатаВремя(НоваяСтрока, "ДатаНачала", ТекОписаниеСобытия, "start");
		ЗаполнитьПолеДатаВремя(НоваяСтрока, "ДатаОкончания", ТекОписаниеСобытия, "end");
	КонецЦикла;
	СтраничныйТокен = РезультатЧтенияJSON["nextPageToken"];
	Если ЗначениеЗаполнено(СтраничныйТокен) Тогда
		ЗаполнитьСобытияКалендаря(ДанныеАвторизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания, СтраничныйТокен);
		Возврат;
	КонецЕсли;
	ОписаниеКалендаря.ТокенСинхронизации = РезультатЧтенияJSON["nextSyncToken"];

КонецПроцедуры

Функция СписокКалендарейПользователя(ДанныеАвторизации)

	СписокКалендарей = Новый Массив;
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		АдресGoogleAPI() + "/calendar/v3/users/me/calendarList");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВызватьGET(СтруктураURI, ДанныеАвторизации));
	РезультатЧтенияJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Если ЗначениеЗаполнено(РезультатЧтенияJSON["error"]) Тогда
		ВызватьИсключение НСтр("ru = 'Приложению запрещен доступ к аккаунту Google.'");
	ИначеЕсли РезультатЧтенияJSON.Получить("items") <> Неопределено Тогда
		Для Каждого ДанныеКалендаря Из РезультатЧтенияJSON.Получить("items") Цикл
			Если ДанныеКалендаря["accessRole"] <> "owner" Тогда
				Продолжить;
			КонецЕсли;
			ОписаниеКалендаря = Новый Структура;
			ОписаниеКалендаря.Вставить("Идентификатор", ДанныеКалендаря.Получить("id"));
			ОписаниеКалендаря.Вставить("Наименование", ДанныеКалендаря.Получить("summary"));
			СписокКалендарей.Добавить(ОписаниеКалендаря);
		КонецЦикла;
	КонецЕсли;
	Возврат СписокКалендарей;

КонецФункции

Функция ДанныеАвторизацииПоКодуРазрешения(КодРазрешения)

	ИдентификаторПриложения = ИдентификаторПриложения();
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		ИдентификаторПриложения.token_uri);
	Соединение = HTTPСоединениеGoogle(СтруктураURI);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Запрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"code=%1&client_id=%2&client_secret=%3&redirect_uri=%4&grant_type=authorization_code",
			КодРазрешения,
			ИдентификаторПриложения.client_id,
			ИдентификаторПриложения.client_secret,
			ИдентификаторПриложения.redirect_uri));
	Попытка	
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		ЗарегистрироватьОшибку(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	ДанныеАвторизации = РегистрыСведений.НастройкиСинхронизацииGoogle.НовыеДанныеАвторизации();
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ДанныеАвторизации.ТокенДоступа = Результат.access_token;
		ДанныеАвторизации.ТипТокенаДоступа = Результат.token_type;
		ДанныеАвторизации.ТокенОбновления = Результат.refresh_token;
	Иначе
		КраткийТекстОшибки = НСтр(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ru = 'Получение сеансовых данных по коду разрешения завершилось ошибкой.
			|Код разрешения: %1'", КодРазрешения));
		ПодробныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сервер вернул состояние: %1
						|Тело ответа: %2'"), Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
		ЗарегистрироватьОшибку(КраткийТекстОшибки, ПодробныйТекстОшибки);
		ВызватьИсключение КраткийТекстОшибки;
	КонецЕсли;
	Возврат ДанныеАвторизации;

КонецФункции

Функция ВызватьGET(СтруктураURI, ДанныеАвторизации)

	Соединение = HTTPСоединениеGoogle(СтруктураURI);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 %2", ДанныеАвторизации["ТипТокенаДоступа"], ДанныеАвторизации["ТокенДоступа"]));
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Запрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, Заголовки);
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		ЗарегистрироватьОшибку(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	Возврат Ответ.ПолучитьТелоКакСтроку();

КонецФункции

Процедура ЗарегистрироватьОшибку(КраткийТекстОшибки, ПодробныйТекстОшибки, ПоказыватьСообщения = Ложь)

	ИмяСобытия = НСтр("ru = 'Синхронизация календарей.Google'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробныйТекстОшибки);
	Если Не ПоказыватьСообщения Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При синхронизации возникла ошибка. Обратитесь к администратору.
			|Текст ошибки:
			|%1'"),
		КраткийТекстОшибки);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

Функция НазваниеЗаписиКалендаряGoogle(ОписаниеЗаписиКалендаря)
	
	НазваниеЗаписиКалендаряGoogle = СтрПолучитьСтроку(ОписаниеЗаписиКалендаря, 1);
	
	Возврат НазваниеЗаписиКалендаряGoogle;
	
КонецФункции

Функция ОписаниеЗаписиКалендаряGoogle(ОписаниеЗаписиКалендаря)
	
	ПозицияРазделителяСтроки = СтрНайти(ОписаниеЗаписиКалендаря, Символы.ПС);
	Если СтрНайти(ОписаниеЗаписиКалендаря, Символы.ПС) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ОписаниеЗаписиКалендаряGoogle = Сред(ОписаниеЗаписиКалендаря, ПозицияРазделителяСтроки + 1);
	
	Возврат ОписаниеЗаписиКалендаряGoogle;
	
КонецФункции

Функция ОписаниеЗаписиКалендаря(НазваниеЗаписиКалендаряGoogle, ОписаниеЗаписиКалендаряGoogle)
	
	ОписаниеЗаписиКалендаря = Строка(НазваниеЗаписиКалендаряGoogle);
	Если ЗначениеЗаполнено(ОписаниеЗаписиКалендаряGoogle) Тогда
		ОписаниеЗаписиКалендаря =
			Строка(ОписаниеЗаписиКалендаря)
			+ Символы.ПС
			+ Строка(ОписаниеЗаписиКалендаряGoogle);
	КонецЕсли;
	
	Возврат ОписаниеЗаписиКалендаря;
	
КонецФункции

#КонецОбласти
